app/controllers/comments_controller.rb

  def create
  	@comment = @post.comments.create(params[:comment].permit(:name, :body))
---
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Alisson"], ["body", "This is my first comment"], ["post_id", 2], ["created_at", "2015-11-06 20:29:30.140107"], ["updated_at", "2015-11-06 20:29:30.140107"]]