app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
	def index
		@posts = Post.order('created_at DESC')